Revit 2027 API
DetailElementOrderUtils.AreDetailElements Method
 Indicates if the elements are all detail elements that participate in detail draw ordering in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool AreDetailElements(
	Document document,
	View view,
	ICollection<ElementId> detailElementIds
)
Public Shared Function AreDetailElements (
	document As Document,
	view As View,
	detailElementIds As ICollection(Of ElementId)
) As Boolean
public:
static bool AreDetailElements(
	Document^ document,
	View^ view,
	ICollection<ElementId^>^ detailElementIds
)
static member AreDetailElements :
        document : Document *
        view : View *
        detailElementIds : ICollection<ElementId> -> bool
Parameters
document Document
 The document.
view View
 The view in which the details appear.
detailElementIds ICollection<ElementId>
 The details to check.
Return Value
Boolean
 True if the detail elements are orderable in the view, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DetailElementOrderUtils Class
Autodesk.Revit.DB Namespace